[
  "csv-obsidian",
  "enhanced-editing",
  "obsidian-style-settings",
  "recent-files-obsidian",
<<<<<<< HEAD
  "obsidian-quiet-outline",
  "cmenu-plugin",
=======
  "buttons",
>>>>>>> 1f5fdd2ec646e9be43a6f0ccfc1903bb5c22a73a
  "calendar",
  "obsidian-banners",
  "hotkey-helper",
  "obsidian-hover-editor",
  "obsidian-memos",
  "workspaces-plus",
  "obsidian-advanced-uri",
  "obsidian-hotkeys-for-specific-files",
  "metaedit",
  "dataview",
  "obsidian-table-to-csv-exporter",
  "cmenu-plugin",
  "cm-chs-patch",
  "obsidian-react-components",
  "obsidian-custom-frames",
  "obsidian-print-preview",
  "obsidian-admonition",
  "table-editor-obsidian",
  "obsidian-bartender",
  "obsidian-collapse-all-plugin",
  "customizable-page-header-buttons",
  "obsidian-dynamic-highlights",
  "obsidian-enhancing-mindmap",
  "obsidian-float-toc-plugin",
  "folder-note-plugin",
  "obsidian-view-mode-by-frontmatter",
  "obsidian-kanban",
  "obsidian-linkcard-plugin",
  "markdown-table-editor",
  "nldates-obsidian",
  "obsidian-echarts",
<<<<<<< HEAD
  "obsidian-table-to-csv-exporter",
  "obsidian-outliner",
  "homepage",
  "dbfolder",
  "waypoint",
  "obsidian-enhancing-mindmap",
  "obsidian-admonition",
  "table-editor-obsidian",
  "obsidian-collapse-all-plugin",
  "cmdr",
  "obsidian-view-mode-by-frontmatter",
  "obsidian-kanban",
  "nldates-obsidian",
  "obsidian42-brat",
=======
  "waypoint",
  "obsidian-version-history-diff",
  "various-complements",
  "obsidian-sortable",
  "search-on-internet",
  "obsidian-quiet-outline",
  "obsidian-outliner",
  "obsidian42-brat",
  "omnisearch",
>>>>>>> 1f5fdd2ec646e9be43a6f0ccfc1903bb5c22a73a
  "periodic-notes",
  "plugin-changelogs",
  "quick-explorer",
  "remember-cursor-position",
<<<<<<< HEAD
  "settings-search",
  "obsidian-sortable",
  "various-complements",
  "obsidian-version-history-diff",
  "obsidian-react-components",
  "obsidian-shellcommands",
  "buttons",
  "templater-obsidian",
  "obsidian-dynamic-highlights",
  "obsidian-bartender",
  "obsidian-reveal-active-file",
  "obsidian-query-control",
  "folder-note-plugin",
  "better-inline-fields",
  "Enhanced-editing",
  "file-tree-alternative",
  "quickadd",
  "obsidian-hide-sidebars-when-narrow"
=======
  "obsidian-better-command-palette",
  "homepage",
  "dbfolder",
  "obsidian-theme-design-utilities",
  "obsidian-contextual-typography"
>>>>>>> 1f5fdd2ec646e9be43a6f0ccfc1903bb5c22a73a
]