[
  "csv-obsidian",
  "enhanced-editing",
  "obsidian-hotkeys-for-specific-files",
  "cm-chs-patch",
  "obsidian-echarts",
  "obsidian-table-to-csv-exporter",
  "obsidian-outliner",
  "homepage",
  "obsidian-view-mode-by-frontmatter",
  "obsidian-kanban",
  "nldates-obsidian",
  "remember-cursor-position",
  "settings-search",
  "obsidian-sortable",
  "various-complements",
  "obsidian-version-history-diff",
  "folder-note-plugin",
  "file-tree-alternative",
  "quickadd",
  "obsidian-dialogue-plugin",
  "periodic-notes",
  "obsidian-memos",
  "obsidian42-brat",
  "metaedit",
  "obsidian-better-command-palette",
  "mrj-text-expand",
  "dataview",
  "obsidian-dynamic-highlights",
  "obsidian-linter",
  "dbfolder",
  "hotkey-helper",
  "waypoint",
  "obsidian-hide-sidebars-when-narrow",
  "obsidian-chat-view",
  "calendar",
  "recent-files-obsidian",
  "obsidian-projects",
  "obsidian-export-image",
  "obsidian-copy-block-link",
  "buttons",
  "copy-document-as-html",
  "better-fn",
  "templater-obsidian",
  "quick-explorer",
  "obsidian-print-preview",
  "tab-switcher",
  "obsidian-hover-editor",
  "obsidian-enhancing-mindmap",
  "obsidian-quiet-outline",
  "Enhanced-editing",
  "obsidian-admonition",
  "table-editor-obsidian",
  "obsidian-advanced-uri",
  "obsidian-another-quick-switcher",
  "obsidian-reveal-active-file",
  "obsidian-react-components",
  "obsidian-mindmap-nextgen",
  "obsidian-style-settings",
  "obsidian-contextual-typography",
  "canvas-presentation",
  "link-nodes-in-canvas",
  "obsidian-linkcard-plugin",
  "canvas-mindmap",
  "obsidian-better-codeblock",
  "canvas-block-reference",
  "creases",
  "obsidian-link-exploder",
  "obsidian-plugin-groups",
  "surfing",
  "omnisearch",
  "cmdr",
  "workspaces-plus",
  "obsidian-emoji-toolbar",
  "canvas-css-class",
  "webpage-html-export",
  "editing-toolbar",
  "floating-toc",
  "ob-table-enhancer",
  "obsidian-banners"
]