[
  "csv-obsidian",
  "enhanced-editing",
  "recent-files-obsidian",
  "calendar",
  "hotkey-helper",
  "obsidian-hover-editor",
  "workspaces-plus",
  "obsidian-advanced-uri",
  "obsidian-hotkeys-for-specific-files",
  "cm-chs-patch",
  "omnisearch",
  "obsidian-linkcard-plugin",
  "markdown-table-editor",
  "obsidian-contextual-typography",
  "dataview",
  "obsidian-echarts",
  "obsidian-table-to-csv-exporter",
  "obsidian-outliner",
  "homepage",
  "obsidian-enhancing-mindmap",
  "obsidian-collapse-all-plugin",
  "cmdr",
  "obsidian-view-mode-by-frontmatter",
  "obsidian-kanban",
  "nldates-obsidian",
  "remember-cursor-position",
  "settings-search",
  "obsidian-sortable",
  "various-complements",
  "obsidian-version-history-diff",
  "obsidian-react-components",
  "obsidian-reveal-active-file",
  "folder-note-plugin",
  "file-tree-alternative",
  "quickadd",
  "obsidian-hide-sidebars-when-narrow",
  "obsidian-style-settings",
  "obsidian-quiet-outline",
  "obsidian-bartender",
  "obsidian-dialogue-plugin",
  "periodic-notes",
  "obsidian-dynamic-highlights",
  "obsidian-banners",
  "obsidian-theme-design-utilities",
  "obsidian-memos",
  "waypoint",
  "obsidian42-brat",
  "table-editor-obsidian",
  "Enhanced-editing",
  "metaedit",
  "quick-explorer",
  "obsidian-admonition",
  "obsidian-table-generator",
  "templater-obsidian",
  "ob-table-enhancer",
  "obsidian-better-command-palette",
  "obsidian-linter",
  "dbfolder",
  "mrj-text-expand",
  "buttons",
  "obsidian-emoji-toolbar",
  "obsidian-editing-toolbar",
  "obsidian-floating-toc"
]